# Example 1. Явное указание типа данных int для переменной
my_variable: int = 42
print(my_variable)

# Example 2. ТАК ПРИВАЛЬНО! Указываем тип данных
num = 666
num2 = str(num)
print(num2)

# Example 3
num1 = 1
num2 = 11
num3 = num1 + num2
print(num3)

print('\n\n')
a = 3
b = 2
print(a + b)
print(a - b)
print(a * b)
print(a / b)

# первым делом выполняется умножение или деление, затем сложение и вычитание. Для изменения порядка
# выполнения операций понадобятся скобки.

c = 3
d = 4

if (a == 3 and b == 2 and
        c == 3 and d == 4):
    print('spam' * 3, sep='*', end='!')

a = 130
b = a // 60
c = a % 60
print(b, c)

print('================================================================')

num = 234
ready = num // 100 % 10
print(ready)

num = 234
ready = num // 10 % 10
print(ready)

num = 234
ready = num // 1 % 10
print(ready)

# num // 1 % 10 - единицы
# num // 10 % 10 - десятки
# num // 100 % 10 - сотни

'''
123456789  // 1 % 10 ---> 9                (единицы)
123456789   // 10 % 10 ---> 8               (десятки)
123456789  // 100 % 10 ---> 7               (сотни)
123456789  // 1000 % 10 ---> 6             (тысячи)
123456789  // 10000 % 10 ---> 5           (десятки тысяч)
123456789  // 100000 % 10 ---> 4         (сотни тысяч)
123456789  // 1000000 % 10 ---> 3       (миллионы)
123456789  // 10000000 % 10 ---> 2     (десятки миллионов)
123456789  // 100000000 % 10 ---> 1   (сотни миллионов)
'''

print('================================================================')

a = 17 // (23 % 7)
b = 34 % a * 5 - 29 % 4 * 3
print(a * b)

a = 3
b = 2
c = (a + b) ** 2
print(c)

print('================================================================')

# n = 2  # Для первого теста 1 + 11 + 111 = 123
# n2 = n * 10
# n3 = n * 100
# print(n, n2, n3)  # мы получили десятки, сотни
# b2 = n2 // 10 % 10
# b3 = n3 // 100 % 10
# m2 = n2 + b2
# m3 = n3 + m2
# sum = n + m2 + m3
# print(sum)

# put your python code here
n = int(input())  # Для первого теста 1 + 11 + 111 = 123
n2 = n * 10
n3 = n * 100
b2 = n2 // 10 % 10
b3 = n3 // 100 % 10
m2 = n2 + b2
m3 = n3 + m2
sum = n + m2 + m3
print(sum)
