# # Напишите программу, которая запрашивает у пользователя три числа и выводит наибольшее из них.
#
# count = 1
#
# for i in range(3):
#     namber = int(input('Введите число: '))
#     count += 1 # счетчик
#     print(count)

max_number = 32
print(f"Наибольшее число: {max_number}")

numbers = []  # Создание пустого списка

num = 10  # Новое значение
numbers.append(num)  # Добавляем значение 10 в список

print(numbers)  # Вывод: [10]

# x -= 2 это x = x - 2
